// Алексей Кузнецов <alek-kuzne@yandex.ru>
// "Алгоритмы и структуры данных. Поиск в массиве. Простые сортиовки"
#include<stdio.h>
#include<malloc.h>

/*
1. Попробовать оптимизировать пузырьковую сортировку. Сравнить количество операций сравнения
    оптимизированной и не оптимизированной программы. Написать функции сортировки, которые возвращают
    количество операций.
*/

/*
2. *Реализовать шейкерную сортировку.
*/

/*
3. Реализовать бинарный алгоритм поиска в виде функции, которой передается отсортированный массив.
    Функция возвращает индекс найденного элемента или -1, если элемент не найден.
*/

/*
4. *Подсчитать количество операций для каждой из сортировок и сравнить его с асимптотической сложностью
    алгоритма.
*/

int main(int argc, char const *argv[])
{
//1.

//2.

//3.

//4.

    return 0;
}
